# MepAnalyticalPipeDesignflow Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MepAnalyticalPipeDesignflow Property
ParameterTypeId Class See Also
---
"Design Flow"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MepAnalyticalPipeDesignflow { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MepAnalyticalPipeDesignflow As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MepAnalyticalPipeDesignflow {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace